In [6]:
# Dependencies
# Pandas
import pandas as pd

# SQL Alchemy
from sqlalchemy import create_engine
from config import pwd

In [7]:
# Create Engine

engine = create_engine('postgresql://postgres:'+ pwd + '@localhost:5432/pewlett_hackard_emp_db')
conn = engine.connect()

In [10]:
# Query All Records in the the Database
data = pd.read_sql("SELECT * FROM employees e\
                   INNER JOIN salaries s ON\
                   e.emp_no = s.emp_no", conn)
data.head()

# data = pd.read_sql_query('SELECT s.emp_no, s.salary, t.title FROM salaries s JOIN employees e ON s.emp_no=e.emp_no JOIN titles t ON e.emp_title_id=t.title_id;', connection)
# df = pd.DataFrame(sql_query)

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date,emp_no,salary
0,10005,s0001,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,10005,78228
1,10010,e0002,1963-06-01,Duangkaew,Piveteau,F,1989-08-24,10010,72488
2,10011,s0001,1953-11-07,Mary,Sluis,F,1990-01-22,10011,42365
3,10013,s0002,1963-06-07,Eberhardt,Terkki,M,1985-10-20,10013,40000
4,10017,s0001,1958-07-06,Cristinel,Bouloucos,F,1993-08-03,10017,71380